# Database Inspection and Migration

In [1]:
! cp ../backend/main.db ../data/sensitive/main.db

In [2]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import os.path

In [3]:
db = create_engine('sqlite:///../data/sensitive/main.db')

In [4]:
query = """
SELECT * FROM churches
"""

In [5]:
pd.read_sql(query, db)

Empty DataFrame
Columns: [id, postcode, latitude, longitude, name, user]
Index: []

In [6]:
qry2 = """
SELECT * FROM sqlite_master
"""

In [7]:
pd.read_sql(qry2, db)

,type,name,tbl_name,rootpage,sql
0,table,members,members,2,"CREATE TABLE members (\n\t""index"" BIGINT, \n\t..."
1,index,ix_members_index,members,3,"CREATE INDEX ix_members_index ON members (""ind..."
2,table,converter,converter,7,"CREATE TABLE converter (\n\tid BIGINT, \n\tpos..."
3,index,ix_converter_id,converter,8,CREATE INDEX ix_converter_id ON converter (id)
4,table,todos,todos,22195,"CREATE TABLE todos (\n\tid INTEGER NOT NULL, \..."
5,table,churches,churches,22196,CREATE TABLE churches (\n\tid INTEGER NOT NULL...
6,table,users,users,22197,CREATE TABLE users (\n\temail VARCHAR(255) NOT...
7,index,sqlite_autoindex_users_1,users,22198,None

In [8]:
qr3 = """
SELECT * FROM users
"""

In [9]:
pd.read_sql(qr3, db)

  email                                      password_hash
0  jack  $pbkdf2-sha256$29000$NIbwPgcA4Ny713qPUcp5Lw$QW...

In [13]:
qry4 = """
PRAGMA table_info(churches)
"""

In [14]:
pd.read_sql(qry4, db)

   cid       name          type  notnull dflt_value  pk
0    0         id       INTEGER        1       None   1
1    1   postcode  VARCHAR(255)        0       None   0
2    2   latitude         FLOAT        0       None   0
3    3  longitude         FLOAT        0       None   0
4    4       name  VARCHAR(255)        0       None   0
5    5       user  VARCHAR(255)        0       None   0

In [16]:
# ! cp ../data/sensitive/main.db ../backend/main.db